[A_Haven_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在本城建造全新建筑的场所。\n每天提供 500 %ICON_GOLD 黄金。"

[A_Haven_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 500 %ICON_GOLD 黄金。"

[A_Haven_CityHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供 1000 %ICON_GOLD 黄金。"

[A_Haven_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供 2000 %ICON_GOLD 黄金。你只能拥有一个国会。"

[A_Haven_Fortification1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产驻军单位直至驻军上限"

[A_Haven_Fortification2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加增长率"

[A_Haven_Fortification3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低增长率"

[A_Haven_ArtilleryRange H7TownTower]
mName="炮兵靶场"
mDesc="在攻城战中为城镇提供2座塔楼。\n为防守军队中的单位增加+10 %ICON_ATTACK 攻击和+15 %ICON_DEFENSE 防御。"

[A_Haven_MagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在本城镇提供7个随机的1阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Haven_MagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在本城镇提供6个随机的2阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Haven_MagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在本城镇提供4个随机的3阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Haven_MagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在本城镇提供2个随机的4阶法术。\n所有满足条件的拜访英雄都将获得这些法术。"

[A_Haven_HallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="提供招募新英雄和战败英雄的选项。新英雄的选择在每周开始时更换。"

[A_Haven_Barracks H7TownDwelling]
mName="兵营"
mDesc="核心生物住所。\n每周可招募21个哨卫。"

[A_Haven_Garrison H7TownDwelling]
mName="驻地"
mDesc="核心生物住所升级。\n可招募并将哨卫升级为军团卫士。\n（基础产量：21/周）"

[A_Haven_RecruitersOffice H7TownGrowthEnhancer]
mName="征兵大厅"
mDesc="核心生物住所升级。\n每周哨卫或军团卫士的产量+11。"

[A_Haven_LoopholeTower H7TownDwelling]
mName="箭孔塔"
mDesc="核心生物住所。\n每周可招募20个弩手。"

[A_Haven_MarksmanTower H7TownDwelling]
mName="神射手城楼"
mDesc="核心生物住所升级。\n可招募并将弩手升级为神射手。\n（基础产量：20/周）"

[A_Haven_ShootingRange H7TownGrowthEnhancer]
mName="靶场"
mDesc="核心生物住所升级。\n每周弩手或神射手的产量+10。"

[A_Haven_BeastLairWolves H7TownDwelling]
mName="兽穴"
mDesc="核心生物住所。\n每周可招募10个狮鹫。"

[A_Haven_BeastDenWolves H7TownDwelling]
mName="兽栏"
mDesc="核心生物住所升级。\n可招募并将狮鹫升级为帝国狮鹫。\n（基础产量：10/周）"

[A_Haven_SlaughterhouseGriffins H7TownGrowthEnhancer]
mName="屠宰场"
mDesc="核心生物住所升级。\n每周狮鹫和帝国狮鹫的产量+10。"

[A_Haven_BeastLairWolves2 H7TownDwelling]
mName="兽巢"
mDesc="核心生物住所。\n每周可招募10个恐狼。"

[A_Haven_BeastDenWolves2 H7TownDwelling]
mName="兽穴"
mDesc="核心生物住所升级。\n可招募并将恐狼升级为银背狼。\n（基础产量：10/周）"

[A_Haven_SlaughterhouseWolves H7TownGrowthEnhancer]
mName="屠宰场"
mDesc="核心生物住所升级。\n每周恐狼/银背狼或狮鹫/帝国狮鹫的产量+5。"

[A_Haven_Priory H7TownDwelling]
mName="修道院"
mDesc="精英生物住所。\n每周可招募6个教士。"

[A_Haven_CathedralOfLight H7TownDwelling]
mName="光明大教堂"
mDesc="精英生物住所升级。\n可招募并将教士升级为司铎。\n（基础产量：6/周）"

[A_Haven_Monastery H7TownGrowthEnhancer]
mName="寺院"
mDesc="精英生物住所升级。\n每周教士和司铎的产量+6。"

[A_Haven_Watchtower H7TownDwelling]
mName="瞭望塔"
mDesc="精英生物住所。\n每周可招募6个守卫官。"

[A_Haven_TowerOfJustice H7TownDwelling]
mName="正义之塔"
mDesc="精英生物住所升级。\n可招募并将守卫官升级为审判官。\n（基础产量：6/周）"

[A_Haven_OfficersHousing H7TownGrowthEnhancer]
mName="军官居所"
mDesc="精英生物住所升级。\n每周守卫官和审判官的产量+6。"

[A_Haven_TrainingGrounds H7TownDwelling]
mName="训练场"
mDesc="精英生物住所。\n每周可招募2个骑兵。"

[A_Haven_ProvingGrounds H7TownDwelling]
mName="试炼场"
mDesc="精英生物住所升级。\n可招募并将骑兵升级为重骑兵。\n（基础产量：2/周）"

[A_Haven_JoustingArena H7TownGrowthEnhancer]
mName="马术竞技场"
mDesc="精英生物住所升级。\n每周骑兵或重骑兵的产量+2。"

[A_Haven_HallsOfHonor H7TownDwelling]
mName="荣誉大厅"
mDesc="冠军生物住所。\n每周可招募2个护国剑士。"

[A_Haven_HallsOfGlory H7TownDwelling]
mName="荣耀殿堂"
mDesc="冠军生物住所升级。\n可招募并将护国剑士升级为卓绝剑士。\n（基础产量：2/周）"

[A_Haven_TranseptOfHeaven H7TownDwelling]
mName="天国走廊"
mDesc="冠军生物住所。\n每周可招募2个炽天使。"

[A_Haven_TranseptOfElysium H7TownDwelling]
mName="极乐回廊"
mDesc="冠军生物住所升级。\n可招募并将炽天使升级为昊天使。\n（基础产量：2/周）"

[A_Haven_Chambre_pretresse H7TownDwelling]
mName="荣耀之门"
mDesc="冠军生物住所。\n可招募至高天使。\n可使用"全部招募"功能招募。\n（基础产量：1/周）"

[A_Haven_chambre_des_michael H7TownDwelling]
mName="小教堂"
mDesc="精英生物住所。\n可招募神圣女祭司。\n可使用"全部招募"功能招募。\n（基础产量：4/周）"

[A_Haven_Blacksmith H7TownUtilityUnitDwelling]
mName="铁匠铺"
mDesc="战争单位生产。\n提供购买圣堂弩车的选项。"

[A_Haven_ConventOfElrath H7TownUtilityUnitDwelling]
mName="艾尔拉思修道院"
mDesc="战争单位生产。\n提供购买治疗修女的选项。"

[A_Haven_Embassy H7TownBuilding]
mName="外交大使"
mDesc="在此城镇控制区域内为你的英雄与中立军队谈判提供+15%成功率。"

[A_Haven_ChampionGuardTower H7TownGuardGrowthEnhancer]
mName="冠军守卫塔"
mDesc="增加民兵的生物容量10%。"

[A_Haven_RecruitersOutpost H7TownBuilding]
mName="征兵哨站"
mDesc="此城镇中增加产量的住所升级也会增加此城镇控制区域内其他相同生物住所的产量。"

[A_Haven_ResourceSilo H7TownSiloBuilding]
mName="物资仓库"
mDesc="每天随机提供1 %icon_Crystal 龙血水晶、%icon_Dragonsteel 龙钢、%icon_Shadowsteel 影钢或%icon_Starsilver 星银。"

[A_Haven_HorseStables H7TownBuilding]
mName="马厩"
mDesc="拜访英雄获得+5移动力直到周末结束。"

[A_Haven_MarketPlace H7TownMarketplace]
mName="集市"
mDesc="提供交易资源的选项。"

[A_Haven_ThievesGuild H7TownThiefGuild]
mName="潜行公会"
mDesc="提供支付获取对手信息的选项。"

[A_Haven_Moats H7TownMoat]
mName="护城河"
mDesc="在攻城战中为城镇装备护城河。\n踏入其中的敌方生物将被中断，小型生物直到其下一回合结束前无法行动。"

[A_Haven_AlchemistLab H7TownBuilding]
mName="炼金实验室"
mDesc="每天提供1 %icon_Starsilver 星银。"

[A_Haven_ChoralOfBelievers H7TownBuilding]
mName="唱诗班"
mDesc="在此城镇控制区域内，你的英雄施放的光系法术会提高一个等级。"

[A_Haven_TownPortal H7TownPortal]
mName="城镇传送门"
mDesc="向所有拜访本城镇的英雄提供瞬间回城法术。\n使拥有此法术的英雄在这是最近的可用城镇时能够返回此城镇。"

[A_Haven_ElrathsInfiniteMercy H7TownTearOfAsha]
mName="光龙之仁"
mDesc="每天提供5000 %ICON_GOLD 黄金并增加此城镇50%的生物产量。\n每场战斗后复活10%的损失单位。"

[HavenBuildingAbilities.A_Haven_RecruitersOutpost_TownAbility H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[HavenBuildingAbilities.A_Haven_RecruitersOutpost_RecruitersOffice_Buff H7BaseBuff]
mName="征兵哨站 - 征兵大厅增益"
mTooltip=""

[HavenBuildingAbilities.A_Haven_ChoralOfBelievers_HeroBuff H7BaseBuff]
mName="唱诗班"
mTooltip="英雄在当前控制区域内施放光系法术提高一个等级。"

[HavenBuildingAbilities.A_Haven_ElrathsInfiniteMercy_TownBuff H7BaseBuff]
mName="光龙之仁"
mTooltip=""

[HavenBuildingAbilities.A_Haven_ChoralOfBelievers_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[HavenBuildingAbilities.A_Haven_RecruitersOutpost_ShootingRange_Buff H7BaseBuff]
mName="征兵哨站 - 靶场增益"
mTooltip=""

[HavenBuildingAbilities.A_Haven_ElrathsInfiniteMercy_HeroBuff H7BaseBuff]
mName="光龙之仁"
mTooltip="所有你的英雄在胜利战斗后复活 %special 所有非亡灵和非构造体生物。"

[HavenBuildingAbilities.A_Haven_RecruitersOutpost_Monastery_Buff H7BaseBuff]
mName="征兵哨站 - 寺院增益"
mTooltip=""

[HavenBuildingAbilities.A_Haven_RecruitersOutpost_BuildingAbility H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[HavenBuildingAbilities.A_Haven_RecruitersOutpost_Slaughterhouse_Buff H7BaseBuff]
mName="征兵哨站 - 屠宰场增益"
mTooltip=""

[HavenBuildingAbilities.A_Haven_Embassy_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[HavenBuildingAbilities.A_Haven_RecruitersOutpost_OfficersHousings_Buff H7BaseBuff]
mName="征兵哨站 - 军官居所增益"
mTooltip=""

[HavenBuildingAbilities.A_Haven_HorseStables_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="马厩能力"
mTooltip=""

[HavenBuildingAbilities.A_Haven_RecruitersOutpost_JoustingArena_Buff H7BaseBuff]
mName="征兵哨站 - 马术竞技场增益"
mTooltip=""

[HavenBuildingAbilities.A_Haven_ElrathsInfiniteMercy_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[HavenBuildingAbilities.A_HavenChoralOfBelievers_HeroBuff H7BaseBuff]
mName="唱诗班"
mTooltip="在当前控制区域内，英雄的所有光系法术施放等级提高一阶。"

[HavenBuildingAbilities.A_HavenEmbassy_Buff H7BaseBuff]
mName="外交大使"
mTooltip="当前控制区域内对中立生物的外交成功几率增加15%。"

[HavenBuildingAbilities.A_HavenHorseStables_Ability H7BaseAbility]
mName="马厩能力"

[HavenBuildingAbilities.A_HavenHorseStables_Buff H7BaseBuff]
mName="马厩"
mTooltip="%stat1 %stat1.icon 移动力直到周末结束。"

[HavenBuildingAbilities.A_HavenRecruitersOutpost_Buff H7BaseBuff]
mName="征兵哨站"
mTooltip="此住所接收当前控制区域内城镇建造的所有结构带来的产量增益。"

7.5_mod : 

新增第8单位槽选项

v1.30

新增替代单位 - 狮鹫，以及狮鹫和狼的隐藏能力

v1.37：

修正塔楼描述以说明防守者属性增益
进行了许多修正和调整，使各城堡的描述更加一致和正确